Revit 2023 API
GroupTypeId.Flexible Property
 "Adaptive Component"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)
Syntax
C#
public static ForgeTypeId Flexible { get; }
Visual Basic
Public Shared ReadOnly Property Flexible As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ Flexible {
	ForgeTypeId^ get ();
}
See Also
GroupTypeId Class
Autodesk.Revit.DB Namespace